:PROPERTIES:
:ID:       002B2928-C32F-49F3-B93F-CBEEE215A7D7
:END:
#+title: python

Python has become one of the most popular languages for application
development.  It and JavaScript seem to be the major contenders for
high-level work including working with AI.

* Configuring for Babel

#+begin_src emacs-lisp
  (require 'ob-python)
#+end_src

#+RESULTS:
: ob-python

* Setting up a Virtual Environment
:PROPERTIES:
:ID:       A3C4A953-79CA-4160-AB26-A6EDCCD8AC09
:END:

Python can manage local environments with dependencies using its
built-in ~venv~ functionality. Within a notebook this will be
supported through creating the relevant directory, and then
updating blocks to use the python within that directory.

~uv~ /may/ offer an easier approach for some of this...I'm currently reading
a couple python books that I hope cover that (but am not particularly
concerned either way).

Creating under ~/tmp~ seems like a reasonable practice by default.

Ocassionally something may get messed up, where recreating the venv is the brute force fix.

** Create the venv

This invokes the host python.

#+name: create-venv
#+begin_src shell :var host_py="python3" :var venv="/tmp/test"
  ${host_py} -m venv ${venv}
#+end_src

#+RESULTS:

#+begin_src shell :var venv="/tmp/test" :results output
  tree ${venv}
#+end_src

** Installing dependencies (w/ pip)

Dependencies can be installed within the venv by invoking ~pip~ with
the venv python.

#+begin_src shell :var venv_py="/tmp/test/bin/python" :results output
  ${venv_py} -m pip install tiktoken
#+end_src

#+RESULTS:
: Requirement already satisfied: tiktoken in /private/tmp/test/lib/python3.14/site-packages (0.13.0)
: Requirement already satisfied: regex in /private/tmp/test/lib/python3.14/site-packages (from tiktoken) (2026.5.9)
: Requirement already satisfied: requests in /private/tmp/test/lib/python3.14/site-packages (from tiktoken) (2.34.2)
: Requirement already satisfied: charset_normalizer<4,>=2 in /private/tmp/test/lib/python3.14/site-packages (from requests->tiktoken) (3.4.7)
: Requirement already satisfied: idna<4,>=2.5 in /private/tmp/test/lib/python3.14/site-packages (from requests->tiktoken) (3.18)
: Requirement already satisfied: urllib3<3,>=1.26 in /private/tmp/test/lib/python3.14/site-packages (from requests->tiktoken) (2.7.0)
: Requirement already satisfied: certifi>=2023.5.7 in /private/tmp/test/lib/python3.14/site-packages (from requests->tiktoken) (2026.5.20)

** Conventions

*** Current Guidance

This currently is a bit stuck in the middle of [[id:DF79A72C-570A-49C8-A566-D494C59F732C][Packaging Up Behaviors]], so the idea for now
would be to typically just provide all of the header args.

The function defined here can be used to produce the values which can be invoked to insert
the appropriate value.

#+begin_src emacs-lisp
  (defun mw/pyvenv-header-args (host_py venv)
    "Produce a value for header args with the provided host_py and venv variabels."
    (let (venv-py (format "%s/bin/python" venv))
      (insert (string-join
  	     (list
  	      (format ":var host_py=\"%s\"" host_py)
  	      (format ":var venv=\"%s\"" venv)
  	      (format ":var venv_py=\"%s\"" venv-py)
  	      (format ":python \"%s\"" venv-py)
  	      " ")))))
#+end_src

*** Sample
:PROPERTIES:
:header-args: :var host_py="python3" :var venv=(format "%s" venv) :var venv_py=(format "%s/bin/python" venv)
:END:

This setup can be facilitated through the defining some common
variables on a file/subtree level...which are attached to this
~Sample~ heading as an example.

This will rely on file local variables defined typically in the first line.

#+begin_src shell :results output
  echo host_py: ${host_py}
  echo venv: ${venv}
  echo venv_py: ${venv_py}
#+end_src

#+RESULTS:
: host_py: python3
: venv: /tmp/top
: venv_py: /tmp/top/bin/python

**** Render the Property

#+begin_src emacs-lisp
  (org-entry-get (point) "header-args")
#+end_src

#+RESULTS:

*** Try Function


**** Nested
:PROPERTIES:
:header-args: (mw/pyvenv-header-args "py3" "test")
:END:

#+begin_src shell
  echo host_py: ${host_py}
  echo venv: ${venv}
  echo venv_py: ${venv_py}
#+end_src

#+RESULTS:
| host_py: |
| venv:    |
| venv_py: |

* Help

** Help

*** pydoc

#+begin_src shell :results output
  python3 -m pydoc
#+end_src

#+RESULTS:
#+begin_example
pydoc - the Python documentation tool

pydoc <name> ...
    Show text documentation on something.  <name> may be the name of a
    Python keyword, topic, function, module, or package, or a dotted
    reference to a class or function within a module or module in a
    package.  If <name> contains a '/', it is used as the path to a
    Python source file to document. If name is 'keywords', 'topics',
    or 'modules', a listing of these things is displayed.

pydoc -k <keyword>
    Search for a keyword in the synopsis lines of all available modules.

pydoc -n <hostname>
    Start an HTTP server with the given hostname (default: localhost).

pydoc -p <port>
    Start an HTTP server on the given port on the local machine.  Port
    number 0 can be used to get an arbitrary unused port.

pydoc -b
    Start an HTTP server on an arbitrary unused port and open a web browser
    to interactively browse documentation.  This option can be used in
    combination with -n and/or -p.

pydoc -w <name> ...
    Write out the HTML documentation for a module to a file in the current
    directory.  If <name> contains a '/', it is treated as a filename; if
    it names a directory, documentation is written for all the contents.

#+end_example

#+begin_src shell :results output
  python3 -m pydoc help
#+end_src

#+RESULTS:
#+begin_example
Help on _Helper in module _sitebuiltins object:

help = class _Helper(builtins.object)
 |  Define the builtin 'help'.
 |
 |  This is a wrapper around pydoc.help that provides a helpful message
 |  when 'help' is typed at the Python interactive prompt.
 |
 |  Calling help() at the Python prompt starts an interactive help session.
 |  Calling help(thing) prints help for the python object 'thing'.
 |
 |  Methods defined here:
 |
 |  __call__(self, *args, **kwds)
 |      Call self as a function.
 |
 |  __repr__(self)
 |      Return repr(self).
 |
 |  ----------------------------------------------------------------------
 |  Data descriptors defined here:
 |
 |  __dict__
 |      dictionary for instance variables
 |
 |  __weakref__
 |      list of weak references to the object

#+end_example

** List Available Modules

#+begin_src python :results output
  help('modules')
#+end_src

#+RESULTS:
#+begin_example

Please wait a moment while I gather a list of all available modules...

__future__          _stat               faulthandler        reprlib
__hello__           _statistics         fcntl               resource
__phello__          _string             filecmp             rlcompleter
_abc                _strptime           fileinput           runpy
_aix_support        _struct             fnmatch             sched
_android_support    _suggestions        fractions           secrets
_apple_support      _symtable           ftplib              select
_ast                _sysconfig          functools           selectors
_ast_unparse        _sysconfigdata__darwin_darwin gc                  shelve
_asyncio            _testbuffer         genericpath         shlex
_bisect             _testcapi           getopt              shutil
_blake2             _testclinic         getpass             signal
_bz2                _testclinic_limited gettext             site
_codecs             _testimportmultiple glob                sitecustomize
_codecs_cn          _testinternalcapi   graphlib            smtplib
_codecs_hk          _testlimitedcapi    grp                 socket
_codecs_iso2022     _testmultiphase     gzip                socketserver
_codecs_jp          _testsinglephase    hashlib             sqlite3
_codecs_kr          _thread             heapq               sre_compile
_codecs_tw          _threading_local    hmac                sre_constants
_collections        _tokenize           html                sre_parse
_collections_abc    _tracemalloc        http                ssl
_colorize           _types              idlelib             stat
_compat_pickle      _typing             imaplib             statistics
_contextvars        _uuid               importlib           string
_csv                _warnings           inspect             stringprep
_ctypes             _weakref            io                  struct
_ctypes_test        _weakrefset         ipaddress           subprocess
_curses             _xxtestfuzz         itertools           svn
_curses_panel       _zoneinfo           json                symtable
_datetime           _zstd               keyword             sys
_dbm                abc                 libsvn              sysconfig
_decimal            annotationlib       linecache           syslog
_elementtree        antigravity         locale              tabnanny
_functools          argparse            logging             tarfile
_hashlib            array               lzma                tempfile
_heapq              ast                 mailbox             termios
_hmac               asyncio             marshal             test
_imp                atexit              math                textwrap
_interpchannels     base64              mimetypes           this
_interpqueues       bdb                 mmap                threading
_interpreters       binascii            modulefinder        time
_io                 bisect              multiprocessing     timeit
_ios_support        botan3              ndiff               tkinter
_json               builtins            netrc               token
_locale             bz2                 ntpath              tokenize
_lsprof             cProfile            nturl2path          tomllib
_lzma               calendar            numbers             trace
_markupbase         certifi             opcode              traceback
_md5                cmath               operator            tracemalloc
_multibytecodec     cmd                 optparse            tty
_multiprocessing    code                os                  turtle
_opcode             codecs              packaging           turtledemo
_opcode_metadata    codeop              pathlib             types
_operator           collections         pdb                 typing
_osx_support        colorsys            pickle              unicodedata
_pickle             compileall          pickletools         unittest
_posixshmem         compression         pip                 urllib
_posixsubprocess    concurrent          pkgutil             uuid
_py_abc             configparser        platform            venv
_py_warnings        contextlib          plistlib            warnings
_pydatetime         contextvars         poplib              wave
_pydecimal          copy                posix               weakref
_pyio               copyreg             posixpath           webbrowser
_pylong             csv                 pprint              wheel
_pyrepl             ctypes              profile             wsgiref
_queue              curses              pstats              xml
_random             dataclasses         pty                 xmlrpc
_remote_debugging   datetime            pwd                 xxlimited
_scproxy            dbm                 py_compile          xxlimited_35
_sha1               decimal             pyclbr              xxsubtype
_sha2               difflib             pydoc               zipapp
_sha3               dis                 pydoc_data          zipfile
_signal             doctest             pyexpat             zipimport
_sitebuiltins       email               queue               zlib
_socket             encodings           quopri              zoneinfo
_sqlite3            ensurepip           random              
_sre                enum                re                  
_ssl                errno               readline            

Enter any module name to get more help.  Or, type "modules spam" to search
for modules whose name or summary contain the string "spam".

#+end_example

* Env

** Print Environment

#+begin_src python :results silent
  import os

  return os.environ
#+end_src

* Processes

** subprocess

#+begin_src python :results output
  import subprocess
  help(subprocess)
#+end_src

#+RESULTS:
#+begin_example
Help on module subprocess:

NAME
    subprocess - Subprocesses with accessible I/O streams

DESCRIPTION
    This module allows you to spawn processes, connect to their
    input/output/error pipes, and obtain their return codes.

    For a complete description of this module see the Python documentation.

    Main API
    ========
    run(...): Runs a command, waits for it to complete, then returns a
              CompletedProcess instance.
    Popen(...): A class for flexibly executing a command in a new process

    Constants
    ---------
    DEVNULL: Special value that indicates that os.devnull should be used
    PIPE:    Special value that indicates a pipe should be created
    STDOUT:  Special value that indicates that stderr should go to stdout


    Older API
    =========
    call(...): Runs a command, waits for it to complete, then returns
        the return code.
    check_call(...): Same as call() but raises CalledProcessError()
        if return code is not 0
    check_output(...): Same as check_call() but returns the contents of
        stdout instead of a return code
    getoutput(...): Runs a command in the shell, waits for it to complete,
        then returns the output
    getstatusoutput(...): Runs a command in the shell, waits for it to complete,
        then returns a (exitcode, output) tuple

CLASSES
    builtins.Exception(builtins.BaseException)
        SubprocessError
            CalledProcessError
            TimeoutExpired
    builtins.object
        CompletedProcess
        Popen

    class CalledProcessError(SubprocessError)
     |  CalledProcessError(returncode, cmd, output=None, stderr=None)
     |
     |  Raised when run() is called with check=True and the process
     |  returns a non-zero exit status.
     |
     |  Attributes:
     |    cmd, returncode, stdout, stderr, output
     |
     |  Method resolution order:
     |      CalledProcessError
     |      SubprocessError
     |      builtins.Exception
     |      builtins.BaseException
     |      builtins.object
     |
     |  Methods defined here:
     |
     |  __init__(self, returncode, cmd, output=None, stderr=None)
     |      Initialize self.  See help(type(self)) for accurate signature.
     |
     |  __str__(self)
     |      Return str(self).
     |
     |  ----------------------------------------------------------------------
     |  Data descriptors defined here:
     |
     |  stdout
     |      Alias for output attribute, to match stderr
     |
     |  ----------------------------------------------------------------------
     |  Data descriptors inherited from SubprocessError:
     |
     |  __weakref__
     |      list of weak references to the object
     |
     |  ----------------------------------------------------------------------
     |  Static methods inherited from builtins.Exception:
     |
     |  __new__(*args, **kwargs) class method of builtins.Exception
     |      Create and return a new object.  See help(type) for accurate signature.
     |
     |  ----------------------------------------------------------------------
     |  Methods inherited from builtins.BaseException:
     |
     |  __reduce__(self, /)
     |      Helper for pickle.
     |
     |  __repr__(self, /)
     |      Return repr(self).
     |
     |  __setstate__(self, state, /)
     |
     |  add_note(self, note, /)
     |      Add a note to the exception
     |
     |  with_traceback(self, tb, /)
     |      Set self.__traceback__ to tb and return self.
     |
     |  ----------------------------------------------------------------------
     |  Data descriptors inherited from builtins.BaseException:
     |
     |  __cause__
     |
     |  __context__
     |
     |  __dict__
     |
     |  __suppress_context__
     |
     |  __traceback__
     |
     |  args

    class CompletedProcess(builtins.object)
     |  CompletedProcess(args, returncode, stdout=None, stderr=None)
     |
     |  A process that has finished running.
     |
     |  This is returned by run().
     |
     |  Attributes:
     |    args: The list or str args passed to run().
     |    returncode: The exit code of the process, negative for signals.
     |    stdout: The standard output (None if not captured).
     |    stderr: The standard error (None if not captured).
     |
     |  Methods defined here:
     |
     |  __init__(self, args, returncode, stdout=None, stderr=None)
     |      Initialize self.  See help(type(self)) for accurate signature.
     |
     |  __repr__(self)
     |      Return repr(self).
     |
     |  check_returncode(self)
     |      Raise CalledProcessError if the exit code is non-zero.
     |
     |  ----------------------------------------------------------------------
     |  Class methods defined here:
     |
     |  __class_getitem__ = GenericAlias(args, /)
     |      Represent a PEP 585 generic type
     |
     |      E.g. for t = list[int], t.__origin__ is list and t.__args__ is (int,).
     |
     |  ----------------------------------------------------------------------
     |  Data descriptors defined here:
     |
     |  __dict__
     |      dictionary for instance variables
     |
     |  __weakref__
     |      list of weak references to the object

    class Popen(builtins.object)
     |  Popen(
     |      args,
     |      bufsize=-1,
     |      executable=None,
     |      stdin=None,
     |      stdout=None,
     |      stderr=None,
     |      preexec_fn=None,
     |      close_fds=True,
     |      shell=False,
     |      cwd=None,
     |      env=None,
     |      universal_newlines=None,
     |      startupinfo=None,
     |      creationflags=0,
     |      restore_signals=True,
     |      start_new_session=False,
     |      pass_fds=(),
     |      *,
     |      user=None,
     |      group=None,
     |      extra_groups=None,
     |      encoding=None,
     |      errors=None,
     |      text=None,
     |      umask=-1,
     |      pipesize=-1,
     |      process_group=None
     |  )
     |
     |  Execute a child program in a new process.
     |
     |  For a complete description of the arguments see the Python documentation.
     |
     |  Arguments:
     |    args: A string, or a sequence of program arguments.
     |
     |    bufsize: supplied as the buffering argument to the open() function when
     |        creating the stdin/stdout/stderr pipe file objects
     |
     |    executable: A replacement program to execute.
     |
     |    stdin, stdout and stderr: These specify the executed programs' standard
     |        input, standard output and standard error file handles, respectively.
     |
     |    preexec_fn: (POSIX only) An object to be called in the child process
     |        just before the child is executed.
     |
     |    close_fds: Controls closing or inheriting of file descriptors.
     |
     |    shell: If true, the command will be executed through the shell.
     |
     |    cwd: Sets the current directory before the child is executed.
     |
     |    env: Defines the environment variables for the new process.
     |
     |    text: If true, decode stdin, stdout and stderr using the given encoding
     |        (if set) or the system default otherwise.
     |
     |    universal_newlines: Alias of text, provided for backwards compatibility.
     |
     |    startupinfo and creationflags (Windows only)
     |
     |    restore_signals (POSIX only)
     |
     |    start_new_session (POSIX only)
     |
     |    process_group (POSIX only)
     |
     |    group (POSIX only)
     |
     |    extra_groups (POSIX only)
     |
     |    user (POSIX only)
     |
     |    umask (POSIX only)
     |
     |    pass_fds (POSIX only)
     |
     |    encoding and errors: Text mode encoding and error handling to use for
     |        file objects stdin, stdout and stderr.
     |
     |  Attributes:
     |      stdin, stdout, stderr, pid, returncode
     |
     |  Methods defined here:
     |
     |  __del__(self, _maxsize=9223372036854775807, _warn=<built-in function warn>)
     |
     |  __enter__(self)
     |
     |  __exit__(self, exc_type, value, traceback)
     |
     |  __init__(
     |      self,
     |      args,
     |      bufsize=-1,
     |      executable=None,
     |      stdin=None,
     |      stdout=None,
     |      stderr=None,
     |      preexec_fn=None,
     |      close_fds=True,
     |      shell=False,
     |      cwd=None,
     |      env=None,
     |      universal_newlines=None,
     |      startupinfo=None,
     |      creationflags=0,
     |      restore_signals=True,
     |      start_new_session=False,
     |      pass_fds=(),
     |      *,
     |      user=None,
     |      group=None,
     |      extra_groups=None,
     |      encoding=None,
     |      errors=None,
     |      text=None,
     |      umask=-1,
     |      pipesize=-1,
     |      process_group=None
     |  )
     |      Create new Popen instance.
     |
     |  __repr__(self)
     |      Return repr(self).
     |
     |  communicate(self, input=None, timeout=None)
     |      Interact with process: Send data to stdin and close it.
     |      Read data from stdout and stderr, until end-of-file is
     |      reached.  Wait for process to terminate.
     |
     |      The optional "input" argument should be data to be sent to the
     |      child process, or None, if no data should be sent to the child.
     |      communicate() returns a tuple (stdout, stderr).
     |
     |      By default, all communication is in bytes, and therefore any
     |      "input" should be bytes, and the (stdout, stderr) will be bytes.
     |      If in text mode (indicated by self.text_mode), any "input" should
     |      be a string, and (stdout, stderr) will be strings decoded
     |      according to locale encoding, or by "encoding" if set. Text mode
     |      is triggered by setting any of text, encoding, errors or
     |      universal_newlines.
     |
     |  kill(self)
     |      Kill the process with SIGKILL
     |
     |  poll(self)
     |      Check if child process has terminated. Set and return returncode
     |      attribute.
     |
     |  send_signal(self, sig)
     |      Send a signal to the process.
     |
     |  terminate(self)
     |      Terminate the process with SIGTERM
     |
     |  wait(self, timeout=None)
     |      Wait for child process to terminate; returns self.returncode.
     |
     |  ----------------------------------------------------------------------
     |  Class methods defined here:
     |
     |  __class_getitem__ = GenericAlias(args, /)
     |      Represent a PEP 585 generic type
     |
     |      E.g. for t = list[int], t.__origin__ is list and t.__args__ is (int,).
     |
     |  ----------------------------------------------------------------------
     |  Data descriptors defined here:
     |
     |  __dict__
     |      dictionary for instance variables
     |
     |  __weakref__
     |      list of weak references to the object
     |
     |  universal_newlines

    class SubprocessError(builtins.Exception)
     |  # Exception classes used by this module.
     |
     |  Method resolution order:
     |      SubprocessError
     |      builtins.Exception
     |      builtins.BaseException
     |      builtins.object
     |
     |  Data descriptors defined here:
     |
     |  __weakref__
     |      list of weak references to the object
     |
     |  ----------------------------------------------------------------------
     |  Static methods inherited from builtins.Exception:
     |
     |  __new__(*args, **kwargs) class method of builtins.Exception
     |      Create and return a new object.  See help(type) for accurate signature.
     |
     |  ----------------------------------------------------------------------
     |  Methods inherited from builtins.BaseException:
     |
     |  __init__(self, /, *args, **kwargs)
     |      Initialize self.  See help(type(self)) for accurate signature.
     |
     |  __reduce__(self, /)
     |      Helper for pickle.
     |
     |  __repr__(self, /)
     |      Return repr(self).
     |
     |  __setstate__(self, state, /)
     |
     |  __str__(self, /)
     |      Return str(self).
     |
     |  add_note(self, note, /)
     |      Add a note to the exception
     |
     |  with_traceback(self, tb, /)
     |      Set self.__traceback__ to tb and return self.
     |
     |  ----------------------------------------------------------------------
     |  Data descriptors inherited from builtins.BaseException:
     |
     |  __cause__
     |
     |  __context__
     |
     |  __dict__
     |
     |  __suppress_context__
     |
     |  __traceback__
     |
     |  args

    class TimeoutExpired(SubprocessError)
     |  TimeoutExpired(cmd, timeout, output=None, stderr=None)
     |
     |  This exception is raised when the timeout expires while waiting for a
     |  child process.
     |
     |  Attributes:
     |      cmd, output, stdout, stderr, timeout
     |
     |  Method resolution order:
     |      TimeoutExpired
     |      SubprocessError
     |      builtins.Exception
     |      builtins.BaseException
     |      builtins.object
     |
     |  Methods defined here:
     |
     |  __init__(self, cmd, timeout, output=None, stderr=None)
     |      Initialize self.  See help(type(self)) for accurate signature.
     |
     |  __str__(self)
     |      Return str(self).
     |
     |  ----------------------------------------------------------------------
     |  Data descriptors defined here:
     |
     |  stdout
     |
     |  ----------------------------------------------------------------------
     |  Data descriptors inherited from SubprocessError:
     |
     |  __weakref__
     |      list of weak references to the object
     |
     |  ----------------------------------------------------------------------
     |  Static methods inherited from builtins.Exception:
     |
     |  __new__(*args, **kwargs) class method of builtins.Exception
     |      Create and return a new object.  See help(type) for accurate signature.
     |
     |  ----------------------------------------------------------------------
     |  Methods inherited from builtins.BaseException:
     |
     |  __reduce__(self, /)
     |      Helper for pickle.
     |
     |  __repr__(self, /)
     |      Return repr(self).
     |
     |  __setstate__(self, state, /)
     |
     |  add_note(self, note, /)
     |      Add a note to the exception
     |
     |  with_traceback(self, tb, /)
     |      Set self.__traceback__ to tb and return self.
     |
     |  ----------------------------------------------------------------------
     |  Data descriptors inherited from builtins.BaseException:
     |
     |  __cause__
     |
     |  __context__
     |
     |  __dict__
     |
     |  __suppress_context__
     |
     |  __traceback__
     |
     |  args

FUNCTIONS
    call(*popenargs, timeout=None, **kwargs)
        Run command with arguments.  Wait for command to complete or
        for timeout seconds, then return the returncode attribute.

        The arguments are the same as for the Popen constructor.  Example:

        retcode = call(["ls", "-l"])

    check_call(*popenargs, **kwargs)
        Run command with arguments.  Wait for command to complete.  If
        the exit code was zero then return, otherwise raise
        CalledProcessError.  The CalledProcessError object will have the
        return code in the returncode attribute.

        The arguments are the same as for the call function.  Example:

        check_call(["ls", "-l"])

    check_output(*popenargs, timeout=None, **kwargs)
        Run command with arguments and return its output.

        If the exit code was non-zero it raises a CalledProcessError.  The
        CalledProcessError object will have the return code in the returncode
        attribute and output in the output attribute.

        The arguments are the same as for the Popen constructor.  Example:

        >>> check_output(["ls", "-l", "/dev/null"])
        b'crw-rw-rw- 1 root root 1, 3 Oct 18  2007 /dev/null\n'

        The stdout argument is not allowed as it is used internally.
        To capture standard error in the result, use stderr=STDOUT.

        >>> check_output(["/bin/sh", "-c",
        ...               "ls -l non_existent_file ; exit 0"],
        ...              stderr=STDOUT)
        b'ls: non_existent_file: No such file or directory\n'

        There is an additional optional argument, "input", allowing you to
        pass a string to the subprocess's stdin.  If you use this argument
        you may not also use the Popen constructor's "stdin" argument, as
        it too will be used internally.  Example:

        >>> check_output(["sed", "-e", "s/foo/bar/"],
        ...              input=b"when in the course of fooman events\n")
        b'when in the course of barman events\n'

        By default, all communication is in bytes, and therefore any "input"
        should be bytes, and the return value will be bytes.  If in text mode,
        any "input" should be a string, and the return value will be a string
        decoded according to locale encoding, or by "encoding" if set. Text mode
        is triggered by setting any of text, encoding, errors or universal_newlines.

    getoutput(cmd, *, encoding=None, errors=None)
        Return output (stdout or stderr) of executing cmd in a shell.

        Like getstatusoutput(), except the exit status is ignored and the return
        value is a string containing the command's output.  Example:

        >>> import subprocess
        >>> subprocess.getoutput('ls /bin/ls')
        '/bin/ls'

    getstatusoutput(cmd, *, encoding=None, errors=None)
        Return (exitcode, output) of executing cmd in a shell.

        Execute the string 'cmd' in a shell with 'check_output' and
        return a 2-tuple (status, output). The locale encoding is used
        to decode the output and process newlines.

        A trailing newline is stripped from the output.
        The exit status for the command can be interpreted
        according to the rules for the function 'wait'. Example:

        >>> import subprocess
        >>> subprocess.getstatusoutput('ls /bin/ls')
        (0, '/bin/ls')
        >>> subprocess.getstatusoutput('cat /bin/junk')
        (1, 'cat: /bin/junk: No such file or directory')
        >>> subprocess.getstatusoutput('/bin/junk')
        (127, 'sh: /bin/junk: not found')
        >>> subprocess.getstatusoutput('/bin/kill $$')
        (-15, '')

    run(
        ,*popenargs,
        input=None,
        capture_output=False,
        timeout=None,
        check=False,
        ,**kwargs
    )
        Run command with arguments and return a CompletedProcess instance.

        The returned instance will have attributes args, returncode, stdout and
        stderr. By default, stdout and stderr are not captured, and those attributes
        will be None. Pass stdout=PIPE and/or stderr=PIPE in order to capture them,
        or pass capture_output=True to capture both.

        If check is True and the exit code was non-zero, it raises a
        CalledProcessError. The CalledProcessError object will have the return code
        in the returncode attribute, and output & stderr attributes if those streams
        were captured.

        If timeout (seconds) is given and the process takes too long,
         a TimeoutExpired exception will be raised.

        There is an optional argument "input", allowing you to
        pass bytes or a string to the subprocess's stdin.  If you use this argument
        you may not also use the Popen constructor's "stdin" argument, as
        it will be used internally.

        By default, all communication is in bytes, and therefore any "input" should
        be bytes, and the stdout and stderr will be bytes. If in text mode, any
        "input" should be a string, and stdout and stderr will be strings decoded
        according to locale encoding, or by "encoding" if set. Text mode is
        triggered by setting any of text, encoding, errors or universal_newlines.

        The other arguments are the same as for the Popen constructor.

DATA
    DEVNULL = -3
    PIPE = -1
    STDOUT = -2
    __all__ = ['Popen', 'PIPE', 'STDOUT', 'call', 'check_call', 'getstatus...

FILE
    /opt/homebrew/Cellar/python@3.14/3.14.5/Frameworks/Python.framework/Versions/3.14/lib/python3.14/subprocess.py

#+end_example
